---
kind: method
id: M:Autodesk.Revit.DB.Structure.StructuralWallUsageFilter.#ctor(Autodesk.Revit.DB.Structure.StructuralWallUsage)
source: html/e74d7d30-5558-3ecd-ccc0-2fc6da4e5cb5.htm
---
# Autodesk.Revit.DB.Structure.StructuralWallUsageFilter.#ctor Method

Constructs a new instance of a filter to match walls that have the given structural wall usage.

## Syntax (C#)
```csharp
public StructuralWallUsageFilter(
	StructuralWallUsage structuralWallUsage
)
```

## Parameters
- **structuralWallUsage** (`Autodesk.Revit.DB.Structure.StructuralWallUsage`) - The wall structural usage.

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentOutOfRangeException** - A value passed for an enumeration argument is not a member of that enumeration